{"keras_version": "2.1.5-tf", "backend": "tensorflow", "class_name": "Sequential", "config": [{"class_name": "Conv2D", "config": {"padding": "valid", "kernel_regularizer": null, "dilation_rate": [1, 1], "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "dtype": "float32", "use_bias": true, "trainable": true, "activity_regularizer": null, "batch_input_shape": [null, 206, 398, 1], "activation": "relu", "strides": [1, 1], "kernel_size": [7, 7], "name": "conv2d_1", "bias_regularizer": null, "filters": 32, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "dtype": "float32", "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "data_format": "channels_last", "kernel_constraint": null}}, {"class_name": "MaxPooling2D", "config": {"padding": "valid", "strides": [2, 2], "name": "max_pooling2d_1", "dtype": "float32", "trainable": true, "data_format": "channels_last", "pool_size": [2, 2]}}, {"class_name": "Conv2D", "config": {"padding": "valid", "kernel_regularizer": null, "dilation_rate": [1, 1], "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "dtype": "float32", "use_bias": true, "trainable": true, "activity_regularizer": null, "activation": "relu", "strides": [1, 1], "kernel_size": [5, 5], "name": "conv2d_2", "bias_regularizer": null, "filters": 64, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "dtype": "float32", "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "data_format": "channels_last", "kernel_constraint": null}}, {"class_name": "MaxPooling2D", "config": {"padding": "valid", "strides": [2, 2], "name": "max_pooling2d_2", "dtype": "float32", "trainable": true, "data_format": "channels_last", "pool_size": [2, 2]}}, {"class_name": "Conv2D", "config": {"padding": "valid", "kernel_regularizer": null, "dilation_rate": [1, 1], "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "dtype": "float32", "use_bias": true, "trainable": true, "activity_regularizer": null, "activation": "relu", "strides": [1, 1], "kernel_size": [5, 5], "name": "conv2d_3", "bias_regularizer": null, "filters": 64, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "dtype": "float32", "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "data_format": "channels_last", "kernel_constraint": null}}, {"class_name": "MaxPooling2D", "config": {"padding": "valid", "strides": [2, 2], "name": "max_pooling2d_3", "dtype": "float32", "trainable": true, "data_format": "channels_last", "pool_size": [2, 2]}}, {"class_name": "Conv2D", "config": {"padding": "valid", "kernel_regularizer": null, "dilation_rate": [1, 1], "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "dtype": "float32", "use_bias": true, "trainable": true, "activity_regularizer": null, "activation": "relu", "strides": [1, 1], "kernel_size": [3, 3], "name": "conv2d_4", "bias_regularizer": null, "filters": 128, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "dtype": "float32", "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "data_format": "channels_last", "kernel_constraint": null}}, {"class_name": "MaxPooling2D", "config": {"padding": "valid", "strides": [2, 2], "name": "max_pooling2d_4", "dtype": "float32", "trainable": true, "data_format": "channels_last", "pool_size": [2, 2]}}, {"class_name": "Conv2D", "config": {"padding": "valid", "kernel_regularizer": null, "dilation_rate": [1, 1], "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "dtype": "float32", "use_bias": true, "trainable": true, "activity_regularizer": null, "activation": "relu", "strides": [1, 1], "kernel_size": [3, 3], "name": "conv2d_5", "bias_regularizer": null, "filters": 128, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "dtype": "float32", "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "data_format": "channels_last", "kernel_constraint": null}}, {"class_name": "MaxPooling2D", "config": {"padding": "valid", "strides": [2, 2], "name": "max_pooling2d_5", "dtype": "float32", "trainable": true, "data_format": "channels_last", "pool_size": [2, 2]}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "dtype": "float32", "trainable": true}}, {"class_name": "Dropout", "config": {"noise_shape": null, "seed": null, "rate": 0.5, "name": "dropout_1", "dtype": "float32", "trainable": true}}, {"class_name": "Dense", "config": {"kernel_regularizer": null, "bias_constraint": null, "name": "dense_1", "dtype": "float32", "use_bias": true, "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "dtype": "float32", "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "activation": "relu", "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "units": 512, "bias_regularizer": null, "activity_regularizer": null}}, {"class_name": "Dense", "config": {"kernel_regularizer": null, "bias_constraint": null, "name": "dense_2", "dtype": "float32", "use_bias": true, "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "dtype": "float32", "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "activation": "sigmoid", "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "units": 1, "bias_regularizer": null, "activity_regularizer": null}}]}