{"keras_version": "2.1.5-tf", "backend": "tensorflow", "class_name": "Sequential", "config": [{"class_name": "Conv2D", "config": {"bias_constraint": null, "padding": "valid", "activity_regularizer": null, "trainable": true, "activation": "relu", "strides": [1, 1], "kernel_constraint": null, "kernel_size": [7, 7], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "dtype": "float32", "scale": 1.0, "distribution": "uniform", "seed": null}}, "batch_input_shape": [null, 206, 398, 1], "filters": 32, "use_bias": true, "kernel_regularizer": null, "dtype": "float32", "name": "conv2d_1", "dilation_rate": [1, 1], "data_format": "channels_last", "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}}}, {"class_name": "MaxPooling2D", "config": {"padding": "valid", "data_format": "channels_last", "trainable": true, "dtype": "float32", "name": "max_pooling2d_1", "strides": [2, 2], "pool_size": [2, 2]}}, {"class_name": "Conv2D", "config": {"bias_constraint": null, "padding": "valid", "activity_regularizer": null, "trainable": true, "activation": "relu", "strides": [1, 1], "filters": 64, "kernel_size": [5, 5], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "dtype": "float32", "scale": 1.0, "distribution": "uniform", "seed": null}}, "kernel_constraint": null, "use_bias": true, "dilation_rate": [1, 1], "kernel_regularizer": null, "dtype": "float32", "name": "conv2d_2", "data_format": "channels_last", "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}}}, {"class_name": "MaxPooling2D", "config": {"padding": "valid", "data_format": "channels_last", "trainable": true, "dtype": "float32", "name": "max_pooling2d_2", "strides": [2, 2], "pool_size": [2, 2]}}, {"class_name": "Conv2D", "config": {"bias_constraint": null, "padding": "valid", "activity_regularizer": null, "trainable": true, "activation": "relu", "strides": [1, 1], "filters": 64, "kernel_size": [5, 5], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "dtype": "float32", "scale": 1.0, "distribution": "uniform", "seed": null}}, "kernel_constraint": null, "use_bias": true, "dilation_rate": [1, 1], "kernel_regularizer": null, "dtype": "float32", "name": "conv2d_3", "data_format": "channels_last", "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}}}, {"class_name": "MaxPooling2D", "config": {"padding": "valid", "data_format": "channels_last", "trainable": true, "dtype": "float32", "name": "max_pooling2d_3", "strides": [2, 2], "pool_size": [2, 2]}}, {"class_name": "Conv2D", "config": {"bias_constraint": null, "padding": "valid", "activity_regularizer": null, "trainable": true, "activation": "relu", "strides": [1, 1], "filters": 128, "kernel_size": [3, 3], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "dtype": "float32", "scale": 1.0, "distribution": "uniform", "seed": null}}, "kernel_constraint": null, "use_bias": true, "dilation_rate": [1, 1], "kernel_regularizer": null, "dtype": "float32", "name": "conv2d_4", "data_format": "channels_last", "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}}}, {"class_name": "MaxPooling2D", "config": {"padding": "valid", "data_format": "channels_last", "trainable": true, "dtype": "float32", "name": "max_pooling2d_4", "strides": [2, 2], "pool_size": [2, 2]}}, {"class_name": "Conv2D", "config": {"bias_constraint": null, "padding": "valid", "activity_regularizer": null, "trainable": true, "activation": "relu", "strides": [1, 1], "filters": 128, "kernel_size": [3, 3], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "dtype": "float32", "scale": 1.0, "distribution": "uniform", "seed": null}}, "kernel_constraint": null, "use_bias": true, "dilation_rate": [1, 1], "kernel_regularizer": null, "dtype": "float32", "name": "conv2d_5", "data_format": "channels_last", "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}}}, {"class_name": "MaxPooling2D", "config": {"padding": "valid", "data_format": "channels_last", "trainable": true, "dtype": "float32", "name": "max_pooling2d_5", "strides": [2, 2], "pool_size": [2, 2]}}, {"class_name": "Flatten", "config": {"dtype": "float32", "name": "flatten_1", "trainable": true}}, {"class_name": "Dropout", "config": {"noise_shape": null, "rate": 0.5, "trainable": true, "dtype": "float32", "name": "dropout_1", "seed": null}}, {"class_name": "Dense", "config": {"bias_constraint": null, "activity_regularizer": null, "trainable": true, "activation": "relu", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "dtype": "float32", "scale": 1.0, "distribution": "uniform", "seed": null}}, "use_bias": true, "units": 512, "kernel_regularizer": null, "dtype": "float32", "name": "dense_1", "kernel_constraint": null, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}}}, {"class_name": "Dense", "config": {"bias_constraint": null, "activity_regularizer": null, "trainable": true, "activation": "sigmoid", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "dtype": "float32", "scale": 1.0, "distribution": "uniform", "seed": null}}, "use_bias": true, "units": 1, "kernel_regularizer": null, "dtype": "float32", "name": "dense_2", "kernel_constraint": null, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}}}]}